tap "mongodb/brew"
tap "ngrok/ngrok"
tap "simplisafe/simplisafe-tools", "git+ssh://git@github.com/simplisafe/homebrew-simplisafe-tools.git"
# Official Amazon AWS command-line interface
brew "awscli"
brew "node"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Simple zero-configuration command-line HTTP server
brew "http-server"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Deep clean and optimize your Mac
brew "mole"
# Libraries for security-enabled client and server applications
brew "nss"
# Fast, disk space efficient package manager
brew "pnpm"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Download YouTube videos from the command-line
brew "youtube-dl"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Display management tool
cask "betterdisplay"
# Web browser focusing on privacy
cask "brave-browser"
# GUI app for Homebrew
cask "cakebrew"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Universal database tool and SQL client
cask "dbeaver-community"
# Virtual monitor for screen sharing
cask "deskpad"
# Screen colour temperature controller
cask "flux-app"
cask "font-hack-nerd-font"
cask "font-inter"
cask "font-sf-mono"
# Utility to hide menu bar items
cask "hiddenbar"
# System and utility switches
cask "only-switch"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Collaboration platform for API development
cask "postman"
cask "simplisafe/simplisafe-tools/saml-aws-auth"
# Screenshot measurement and annotation tool
cask "shottr"
# Dictation tool including LLM reformatting
cask "superwhisper"
# Music streaming service with high fidelity sound and hi-def video quality
cask "tidal"
# Rust-based terminal
cask "warp"