tap "homebrew/cask"
tap "homebrew/core"
brew "ca-certificates"
brew "cmake"
# brew "nss"
brew "pnpm"
brew "nvm"
brew "smartmontools"
cask "betterdisplay"
cask "deepl"
cask "deskpad"
cask "fanny"
cask "font-geist-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-inter"
cask "font-sf-mono"
cask "hiddenbar"
# cask "itsycal"
# cask "mounty"
cask "only-switch"
cask "pearcleaner"
cask "raycast"
cask "shottr"
