tap "mongodb/brew"
tap "ngrok/ngrok"
tap "simplisafe/simplisafe-tools", "git+ssh://git@github.com/simplisafe/homebrew-simplisafe-tools.git"
# Official Amazon AWS command-line interface
brew "awscli"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Simple zero-configuration command-line HTTP server
brew "http-server"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Deep clean and optimize your Mac
brew "mole"
# Fast, highly customisable system info script
brew "neofetch"
# Libraries for security-enabled client and server applications
brew "nss"
# Fast, disk space efficient package manager
brew "pnpm"
# SMART hard drive monitoring
brew "smartmontools"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Download YouTube videos from the command-line
brew "youtube-dl"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Display management tool
cask "betterdisplay"
# Web browser focusing on privacy
cask "brave-browser"
# GUI app for Homebrew
cask "cakebrew"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Universal database tool and SQL client
cask "dbeaver-community"
# Virtual monitor for screen sharing
cask "deskpad"
# Web browser focusing on privacy
cask "duckduckgo"
# Screen colour temperature controller
cask "flux-app"
cask "font-blex-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-inter"
cask "font-sf-mono"
# Utility to hide menu bar items
cask "hiddenbar"
# Menu bar calendar
cask "itsycal"
# App for launching iOS and Android simulators
cask "minisim"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok/ngrok/ngrok"
# System and utility switches
cask "only-switch"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Collaboration platform for API development
cask "postman"
cask "simplisafe/simplisafe-tools/saml-aws-auth"
# Screenshot measurement and annotation tool
cask "shottr"
# Music streaming service
cask "spotify"
# Dictation tool including LLM reformatting
cask "superwhisper"
# Music streaming service with high fidelity sound and hi-def video quality
cask "tidal"
# Rust-based terminal
cask "warp"
# Native desktop client for WhatsApp
cask "whatsapp@beta"
vscode "antfu.icons-carbon"
vscode "astro-build.astro-vscode"
vscode "aykutsarac.jsoncrack-vscode"
vscode "bierner.markdown-preview-github-styles"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "chakrounanas.turbo-console-log"
vscode "dbaeumer.vscode-eslint"
vscode "drcika.apc-extension"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "gerane.theme-flatlandmonokai"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "johnpapa.vscode-peacock"
vscode "kamikillerto.vscode-colorize"
vscode "kisstkondoros.vscode-codemetrics"
vscode "kumar-harsh.graphql-for-vscode"
vscode "liviuschera.noctis"
vscode "mattpocock.ts-error-translator"
vscode "mechatroner.rainbow-csv"
vscode "miguelsolorio.fluent-icons"
vscode "ms-playwright.playwright"
vscode "nrwl.angular-console"
vscode "oxc.oxc-vscode"
vscode "patbenatar.advanced-new-file"
vscode "pkief.material-icon-theme"
vscode "pmndrs.pmndrs"
vscode "ritwickdey.liveserver"
vscode "simonsiefke.svg-preview"
vscode "sleistner.vscode-fileutils"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-spanish"
vscode "tabnine.tabnine-vscode"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "wayou.vscode-todo-highlight"
