tap "homebrew/cask"
tap "homebrew/core"
tap "ngrok/ngrok"
tap "th-ch/youtube-music"
brew "ca-certificates"
brew "cmake"
brew "flux"
brew "neofetch"
brew "nss"
brew "pnpm"
brew "nvm"
brew "smartmontools"
brew "tree"
cask "betterdisplay"
cask "cursor"
cask "deepl"
cask "deskpad"
cask "fanny"
cask "flux-app"
cask "font-geist-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-inter"
cask "font-sf-mono"
cask "hiddenbar"
cask "itsycal"
cask "minisim"
cask "mounty"
cask "only-switch"
cask "pearcleaner"
cask "raycast"
cask "shottr"
cask "tidal"
cask "whatsapp"
cask "youtube-music"
